### Agenda: 


* Merging dataframe


* Inner, Outer, Left, Outer

---

In [1]:
# Import Libraries

import pandas as pd

In [2]:
df1 = pd.DataFrame([['CA', 'Sacramento'], ['TX', 'Austin'],['AK', 'Juneau'], ['KY', 'Frankfort']],
                  columns=['State', 'Capital'])

df1

  State     Capital
0    CA  Sacramento
1    TX      Austin
2    AK      Juneau
3    KY   Frankfort

In [3]:
df2 = pd.DataFrame([['CA', 567000000], ['TX', 545000000],['AK', 148000000], ['KY', 117000000]],
                  columns=['State', 'search_results'])

df2

  State  search_results
0    CA       567000000
1    TX       545000000
2    AK       148000000
3    KY       117000000

In [4]:
pd.merge(df1,df2, how='inner', on='State')

  State     Capital  search_results
0    CA  Sacramento       567000000
1    TX      Austin       545000000
2    AK      Juneau       148000000
3    KY   Frankfort       117000000